RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MKL17Z4/fsl_clock_MKL17Z4.h
/*!
* @brief Get the the clock gate state for RTC module.
*
* This function will get the clock gate state for RTC module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetRtcGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateRtc0);
}

/*!
* @brief Enable the clock for DAC module.
*
* This function enables the clock for DAC module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_EnableDacClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateDac0);
}

/*!
* @brief Disable the clock for DAC module.
*
* This function disables the clock for DAC module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_DisableDacClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateDac0);
}

/*!
* @brief Get the the clock gate state for DAC module.
*
* This function will get the clock gate state for DAC module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetDacGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateDac0);
}

/*!
* @brief Enable the clock for SPI module.
*
* This function enables the clock for SPI module.
* @param instance module device instance
*/
void CLOCK_SYS_EnableSpiClock(uint32_t instance);

/*!
* @brief Disable the clock for SPI module.
*
* This function disables the clock for SPI module.
* @param instance module device instance
*/
void CLOCK_SYS_DisableSpiClock(uint32_t instance);

/*!
* @brief Get the the clock gate state for SPI module.
*
* This function will get the clock gate state for SPI module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
bool CLOCK_SYS_GetSpiGateCmd(uint32_t instance);

/*!
* @brief Enable the clock for I2C module.
*
* This function enables the clock for I2C module.
* @param instance module device instance
*/
void CLOCK_SYS_EnableI2cClock(uint32_t instance);

/*!
* @brief Disable the clock for I2C module.
*
* This function disables the clock for I2C module.
* @param instance module device instance
*/
void CLOCK_SYS_DisableI2cClock(uint32_t instance);

/*!
* @brief Get the the clock gate state for I2C module.
*
* This function will get the clock gate state for I2C module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance);

/*!
* @brief Enable the clock for LPUART module.
*
* This function enables the clock for LPUART module.
* @param instance module device instance
*/
void CLOCK_SYS_EnableLpuartClock(uint32_t instance);

/*!
* @brief Disable the clock for LPUART module.
*
* This function disables the clock for LPUART module.
* @param instance module device instance
*/
void CLOCK_SYS_DisableLpuartClock(uint32_t instance);

/*!
* @brief Get the the clock gate state for LPUART module.
*
* This function will get the clock gate state for LPUART module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
bool CLOCK_SYS_GetLpuartGateCmd(uint32_t instance);

/*!
* @brief Enable the clock for UART module.
*
* This function enables the clock for UART module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_EnableUartClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateUart2);
}

/*!
* @brief Disable the clock for UART module.
*
* This function disables the clock for UART module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_DisableUartClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateUart2);
}

/*!
* @brief Get the the clock gate state for UART module.
*
* This function will get the clock gate state for UART module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetUartGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM,kSimClockGateUart2);
}

#if FSL_FEATURE_SOC_USB_COUNT
/*!
 * @brief Enable the clock for USBFS module.
 *
 * This function enables the clock for USBFS module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableUsbfsClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateUsbfs0);
}

/*!
 * @brief Disable the clock for USBFS module.
 *
 * This function disables the clock for USBFS module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableUsbfsClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateUsbfs0);
}

/*!
 * @brief Get the the clock gate state for USB module.
 *
 * This function will get the clock gate state for USB module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetUsbfsGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateUsbfs0);
}
#endif// FSL_FEATURE_SOC_USB_COUNT

/*!
* @brief Enable the clock for FLEXIO module.
*
* This function enables the clock for FLEXIO module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_EnableFlexioClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateFlexio0);
}

/*!
* @brief Disable the clock for FLEXIO module.
*
* This function disables the clock for FLEXIO module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_DisableFlexioClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateFlexio0);
}

/*!
* @brief Get the clock gate state for FLEXIO module.
*
* This function will get the clock gate state for FLEXIO module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetFlexioGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM,kSimClockGateFlexio0);
}

/*!
 * @brief Enable the clock for DMA module.
 *
 * This function enables the clock for DMA module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableDmaClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateDma0);
}

/*!
 * @brief Disable the clock for DMA module.
 *
 * This function disables the clock for DMA module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableDmaClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateDma0);
}

/*!
 * @brief Get the the clock gate state for DMA module.
 *
 * This function will get the clock gate state for DMA module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetDmaGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateDma0);
}

/*!
 * @brief Enable the clock for DMAMUX module.
 *
 * This function enables the clock for DMAMUX module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableDmamuxClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateDmamux0);
}

/*!
 * @brief Disable the clock for DMAMUX module.
 *
 * This function disables the clock for DMAMUX module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableDmamuxClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateDmamux0);
}

/*!
 * @brief Get the the clock gate state for DMAMUX module.
 *
 * This function will get the clock gate state for DMAMUX module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetDmamuxGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateDmamux0);
}

/*!
 * @brief Enable the clock for SAI module.
 *
 * This function enables the clock for SAI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableSaiClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateSai0);
}

/*!
 * @brief Disable the clock for SAI module.
 *
 * This function disables the clock for SAI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableSaiClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateSai0);
}

/*!
 * @brief Get the the clock gate state for SAI module.
 *
 * This function will get the clock gate state for SAI module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetSaiGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateSai0);
}

/*!
 * @brief Enable the clock for PIT module.
 *
 * This function enables the clock for PIT module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnablePitClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGatePit0);
}

/*!
 * @brief Disable the clock for PIT module.
 *
 * This function disables the clock for PIT module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisablePitClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGatePit0);
}

/*!
 * @brief Get the the clock gate state for PIT module.
 *
 * This function will get the clock gate state for PIT module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetPitGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGatePit0);
}

/*!
 * @brief Enable the clock for TPM module.
 *
 * This function enables the clock for TPM module.
 * @param instance module device instance
 */
void CLOCK_SYS_EnableTpmClock(uint32_t instance);

/*!
 * @brief Disable the clock for TPM module.
 *
 * This function disables the clock for TPM module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableTpmClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for TPM module.
 *
 * This function will get the clock gate state for TPM module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetTpmGateCmd(uint32_t instance);

#if FSL_FEATURE_SOC_USB_COUNT
/*!
 * @brief Set the USB external clock frequency(USB_CLKIN).
 *
 * This function sets the USB external clock frequency (USB_CLKIN).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequcney value.
 */
static inline void CLOCK_SYS_SetUsbExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < USB_EXT_CLK_COUNT);

    g_usbClkInFreq[srcInstance] = freq;
}
#endif// FSL_FEATURE_SOC_USB_COUNT

/*!
 * @brief Set the TPM external clock frequency(TPM_CLKx).
 *
 * This function sets the TPM external clock frequency (TPM_CLKx).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequcney value.
 */
static inline void CLOCK_SYS_SetTpmExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < TPM_EXT_CLK_COUNT);

    g_tpmClkFreq[srcInstance] = freq;
}

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/


#endif /* __FSL_CLOCK_MKL17Z4__H__ */
/*******************************************************************************
* EOF
******************************************************************************/

